app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["content", "Hi"], ["post_id", 3], ["user_id", 1]]