app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["content", "adsf"], ["created_at", 2016-10-14 23:40:24 UTC], ["updated_at", 2016-10-14 23:40:24 UTC], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.new
    @post = Post.find(params[:id])
    @user = User.find(@post.user_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "posts" SET "votes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["votes", 1], ["updated_at", 2016-11-06 00:11:53 UTC], ["id", 1]]
---
  def upvote
    @post = Post.find(params[:post_id])
    @post.votes += 1
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "votes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["votes", 29], ["updated_at", 2016-11-06 00:21:06 UTC], ["id", 1]]
---
  def downvote
    @post = Post.find(params[:post_id])
    @post.votes -= 1
    @post.save